In [6]:
from datasets import load_dataset
import pandas as pd
import matplotlib.pyplot as plt

# Load Dataset
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])
# df.info()

In [5]:
df.loc[0:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [ ]:
salary_year_avg = df['salary_year_avg'].median()

In [10]:
salary_hour_avg = df['salary_hour_avg'].median()

In [ ]:
# cleated new df to fill the Nan values so wo dont modify the main df
df_filled = df

# filling the Nan values with the median values
df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(salary_year_avg)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(salary_hour_avg)

In [21]:
df_filled.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [22]:
# removing duplicates
df_unique = df_filled

df_unique = df_unique.drop_duplicates()

print('Lenght pf original df: ', len(df_filled))
print('Lenght pf drop duplicates df: ', len(df_unique))
print('Rows removed: ', len(df_filled) - len(df_unique))

Lenght pf original df:  785741
Lenght pf drop duplicates df:  785640
Rows removed:  101

In [ ]:
# removing duplicates using spesific colunm by giving subset value
df_unique = df_unique.drop_duplicates(subset=['job_title', 'company_name'])

print('Lenght pf original df: ', len(df_filled))
print('Lenght pf drop duplicates df: ', len(df_unique))
print('Rows removed: ', len(df_filled) - len(df_unique))

Lenght pf original df:  785741
Lenght pf drop duplicates df:  508042
Rows removed:  277699